colchonet/app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("full_name", "location", "email", "password", "bio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$bYz2jP77LNSuCtvzcjAIWe8s0K3cr5VbDxMxzxPFBGfzxcrKO1LDC"], ["updated_at", "2018-03-06 03:09:49.691011"], ["id", 4]]